const TelegramApi = require('node-telegram-bot-api')

const token = '5556071783:AAHYRBCpkCWLF0RTmrx3ym1sywHUixft-4E'

const bot = new TelegramApi(token, {polling: true})

var randomNumber = Math.random();




bot.on('message',msg => {
    const text = msg.text;
    const chatId = msg.chat.id;

    if(text === 'Здравствуйте)')
        bot.sendMessage(chatId, 'Добрый  день! Какой у Вас вопрос?');
    if(text === 'Доброе утро)')
        bot.sendMessage(chatId, 'Добрый  день! Какой у Вас вопрос?');
    if(text === 'Доброе утро!')
        bot.sendMessage(chatId, 'Добрый  день! Какой у Вас вопрос?');
    if(text === 'Добрый день. Мне нужно узнать баланс')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');
    if(text === '/start')
        bot.sendMessage(chatId, 'Добрый день! Баланс можно узнать по телефону 45-07-07, после приветствия нажать цифру "2"');

})

